import random

words = [
    "книга",
    "учитель",
    "школа",
    "древо",
    "число",
    "река",
    "путешествие",
    "зима",
    "лето",
    "осень",
    "весна",
    "дорога",
    "светло",
    "вечер",
    "утро",
    "друг",
    "счастье",
    "новости",
    "праздник",
    "задание",
    "колесо",
    "жизнь",
    "работа",
    "фотография",
    "радость",
    "музыкант",
    "театр",
    "искусство",
    "культура",
    "планета",
    "дом",
    "город",
    "друзья",
    "песни",
    "приключение",
    "знание",
    "спорт",
    "забота",
    "событие",
    "море",
    "гора",
    "солнце",
    "луна",
    "звезда",
    "песок",
    "ветер",
    "небо",
    "улыбка",
    "вдохновение",
    "мир",
    "космос",
    "семья",
    "собака",
    "кошка",
    "еда",
    "напиток",
    "музыка",
    "танец",
    "вода",
    "цвет",
    "роман",
    "поэзия",
    "история",
    "футбол",
    "бег",
    "пляж",
    "парк",
    "сад",
    "здание",
    "машина",
    "поезд",
    "самолет",
    "путеводитель",
    "пейзаж",
    "сказка",
    "легенда",
    "мода",
    "стиль",
    "технология",
    "наука",
    "исследование",
    "новинка",
    "первый",
    "второй",
    "младший",
    "старший",
    "коллекция",
    "события",
    "ментор",
    "взаимодействие",
    "творчество",
    "исполнение",
    "хобби",
    "журналистика",
    "кинопроизводство",
    "компьютер",
    "программирование",
    "математика"
]

points = {'user': 0, 'comp': 0}

while True:
    a = random.choice(words)
    if is_odd(a):
        continue
    b = random.choice(words)
    if is_odd(b):
        continue
    op = random.choice(("+", "-"))
    if op == "+":
        for i in b:
            if not i in a:
                a = a + i
        ans = a
        user = input(f"{a} + {b} = ")
    else:
        for i in b:
            a = a.replace(i, '')
        ans = a
        user = input(f"{a} - {b} = ")
    if user == str(ans):
        print("Верно!")
        points["player"] += 1
    else:
        print("Ты ошибся. Попробуй ещё разочек.")
        points["comp"] += 1
    print(f'Счёт: {points["user"]}:{points["comp"]}')
    goout = input('Хош выйти? [0/1] ')
    if goout == '1':
        break
